source/hermes/app/controllers/agencia_controller.rb

SELECT "agencia".* FROM "agencia"
---
	def listar_agencia
			a = Agencia.all