source/hermes/app/controllers/general_controller.rb

	def entrar
		begin
			prms = params.permit(
				:login,
				:passwd
				)

			u = Usuario.find_by(
				correo_electronico: prms.require(:login),
				).authenticate(
					prms.require(:passwd)
				)
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."correo_electronico" = 'o@mail.com' LIMIT 1

	def api_token
		begin
			prms = params.permit(
				:login,
				:passwd
				)

			u = Usuario.find_by(
				correo_electronico: prms.require(:login),
				).authenticate(
					prms.require(:passwd)
				)
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."correo_electronico" = 'o@m.com' LIMIT 1

	def info
		begin
			if request.headers.key?("enterprise-token")
				i = request.headers["enterprise-token"].to_i
				e = Empresa.find(i)
---
SELECT  "empresas".* FROM "empresas"  WHERE "empresas"."id" = $1 LIMIT 1  [["id", 1]]