source/hermes/app/controllers/operador_controller.rb

SELECT  "agencia".* FROM "agencia"  WHERE "agencia"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "paquetes".* FROM "paquetes"  WHERE "paquetes"."id" = $1 LIMIT 1  [["id", 41]]
SELECT  "tipo_estados".* FROM "tipo_estados"  WHERE "tipo_estados"."id" = $1 LIMIT 1  [["id", 2]]
---
	def cambiar_estado_paquete
		begin
			puts "----"
			puts params
			puts "----"

			prms = params.permit(
				:id,
				:agencia
			)

			pq = Paquete.find(
				prms.require(:id).to_i
			).cambiar_estado prms.require(:agencia).to_i

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."correo_electronico" = 'o@m.com' LIMIT 1
SELECT  "usuario_interno_agencia".* FROM "usuario_interno_agencia"  WHERE "usuario_interno_agencia"."usuario_id" = 14  ORDER BY "usuario_interno_agencia"."id" ASC LIMIT 1
SELECT DISTINCT on (paquete_id) * FROM "agencia_paquetes"  WHERE "agencia_paquetes"."agencia_id" = 1  ORDER BY "agencia_paquetes"."paquete_id" DESC, "agencia_paquetes"."fecha_arribo" DESC
---
	def listar_paquete
		begin
			prms = params.permit(
				:email
			)

			u = Usuario.find_by!(
				correo_electronico: prms.require(:email)
			)

			a = UsuarioInternoAgencia.where(usuario: u).first

			stt = AgenciaPaquete.select(
				"DISTINCT on (paquete_id) *"
				).where(
					agencia: a.agencia
				).order(
					:paquete_id,
					:fecha_arribo
				).reverse_order

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."correo_electronico" = 'o@m.com' LIMIT 1
UPDATE "usuarios" SET "password_digest" = $1, "updated_at" = $2 WHERE "usuarios"."id" = 14  [["password_digest", "$2a$10$JuSDG0hKJXYHaZ7SShz5UuCMSz34nYWDqBDSU7..A6OljNDfPO.we"], ["updated_at", "2014-10-24 15:13:10.288823"]]
---
	def cambiar_password
		begin
			prms = params.permit(
				:email,
				:password
			)


			atoken = request.headers["api-token"]

			u = Usuario.find_by!(
				correo_electronico: prms.require(:email)
			)

			if atoken != u.api_token
				raise "Credenciales de acceso erroneas, acceso no autorizado"
			end

			u.update(password: prms.require(:password))